Autodesk.Revit.DB.BoundingBoxIntersectsFilter.GetBoundingBox
Gets the outline being used for this filter.
Returns:
The outline being used for this filter.
Since:
2011

Autodesk.Revit.DB.BoundingBoxIntersectsFilter.Tolerance
Allows control over the match criteria by using a tolerance in the geometry comparison. It is suggested to use this in cases where trivial differences should be considered when matching elements.
Remarks:
By default this is set to zero, but depending on your units of measure and how close objects may be, it is advised to set this to something more realistic.
If the tolerance is positive, the outlines may be separated by the tolerance distance in each coordinate.
If the tolerance is negative, the outlines must overlap by at least the tolerance distance in each coordinate.
Since:
2011

Autodesk.Revit.DB.BoundingBoxIntersectsFilter.#ctor(Autodesk.Revit.DB.Outline,System.Double,System.Boolean)
Constructs a new instance of a filter to match elements with a bounding box that intersects the given Outline,
with the option to invert the filter and match all elements with a bounding box that are not intersecting the given Outline.
outline:
The Outline used to find elements with a bounding box that intersect it.
tolerance:
The tolerance value to use instead of zero. See the tolerance property for details.
inverted:
True if the filter should be inverted and match all elements with a bounding box that are not intersecting the given Outline.
Throws Autodesk.Revit.Exceptions.ArgumentException:
outline is an empty Outline.
-or-
The given value for tolerance is not finite
-or-
The given value for tolerance is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.BoundingBoxIntersectsFilter.#ctor(Autodesk.Revit.DB.Outline,System.Double)
Constructs a new instance of a filter to match elements with a bounding box that intersects the given Outline.
outline:
The Outline used to find elements with a bounding box that intersect it.
tolerance:
The tolerance value to use instead of zero. See the tolerance property for details.
Throws Autodesk.Revit.Exceptions.ArgumentException:
outline is an empty Outline.
-or-
The given value for tolerance is not finite
-or-
The given value for tolerance is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.BoundingBoxIntersectsFilter.#ctor(Autodesk.Revit.DB.Outline,System.Boolean)
Constructs a new instance of a filter to match elements with a bounding box that intersects the given Outline,
with the option to invert the filter and match all elements with a bounding box that are not intersecting the given Outline.
outline:
The Outline used to find elements with a bounding box that intersect it.
inverted:
True if the filter should be inverted and match all elements with a bounding box that are not intersecting the given Outline.
Throws Autodesk.Revit.Exceptions.ArgumentException:
outline is an empty Outline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.BoundingBoxIntersectsFilter.#ctor(Autodesk.Revit.DB.Outline)
Constructs a new instance of a filter to match elements with a bounding box that intersects the given Outline.
outline:
The Outline used to find elements with a bounding box that intersect it.
Throws Autodesk.Revit.Exceptions.ArgumentException:
outline is an empty Outline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.BoundingBoxIntersectsFilter
A filter used to match elements with a bounding box that intersects the given Outline.
Remarks:
This filter excludes all objects derived from View and objects derived from ElementType.
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
Since:
2011